In [3]:
import numpy as np
import pandas as pd

In [5]:
labels = ['a','b','c']

In [8]:
minha_lista = [10, 20, 30]
arr = np.array([10,20,30])
d= {'a':10, 'b':20, 'c':30}

In [10]:
pd.Series(data=minha_lista, index=labels)

a    10
b    20
c    30
dtype: int64

In [12]:
series = pd.Series(data=minha_lista, index=labels)

In [13]:
series['b']

20

In [14]:
ser1 = pd.Series([1,2,3,4], index=['EUA', 'Alemanha', ' italia', 'japao'])

In [16]:
ser1

EUA         1
Alemanha    2
 italia     3
japao       4
dtype: int64

In [17]:
ser2 = pd.Series([1,2,3,4], index=['EUA', 'Alemanha', ' URSS', 'japao'])

In [18]:
ser2

EUA         1
Alemanha    2
 URSS       3
japao       4
dtype: int64

In [19]:
ser1 + ser2

 URSS       NaN
 italia     NaN
Alemanha    4.0
EUA         2.0
japao       8.0
dtype: float64

In [20]:
#acabou a aula de series
#começa a aula de dataframes

In [21]:
np.random.seed(101)

In [25]:
df = pd.DataFrame(np.random.randn(5,4), index='A B C D E'.split(), columns='W X Y Z'. split())

In [26]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [27]:
df['W']

A    0.386030
B    0.681209
C   -1.005187
D   -1.382920
E    0.992573
Name: W, dtype: float64

In [28]:
type(df['W'])

pandas.core.series.Series

In [29]:
type(df)

pandas.core.frame.DataFrame

In [33]:
#usado para não confundir com os 
#métodos, pois eles usam . para isso
df[['W', 'Z']]

          W         Z
A  0.386030  0.230336
B  0.681209  1.939932
C -1.005187 -0.732845
D -1.382920 -2.141212
E  0.992573  1.292765

In [34]:
df[['W']]

          W
A  0.386030
B  0.681209
C -1.005187
D -1.382920
E  0.992573

In [32]:
#Usado em MySQL
df.W

A    0.386030
B    0.681209
C   -1.005187
D   -1.382920
E    0.992573
Name: W, dtype: float64

In [36]:
#criar coluna nova dentro do data frame 'df'
#que é a soma de W + Z
df['nova_coluna']= df['W'] + df['Z']

In [37]:
df

          W         X         Y         Z  nova_coluna
A  0.386030  2.084019 -0.376519  0.230336     0.616367
B  0.681209  1.035125 -0.031160  1.939932     2.621142
C -1.005187 -0.741790  0.187125 -0.732845    -1.738032
D -1.382920  1.482495  0.961458 -2.141212    -3.524132
E  0.992573  1.192241 -1.046780  1.292765     2.285338

In [42]:
#deletar a coluna
df.drop('nova_coluna', axis=1, inplace=True)

In [43]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [44]:
#retirando um valor dedentro do data frame.
#Encontrando 0,38603...
df.loc['A','W']

0.3860303121135517

In [45]:
#Encontrando somente linhas 'A' e 'B'
#Encontrando somente colunas 'X', 'Y' e 'Z'
df.loc[['A', 'B'], ['X', 'Y', 'Z']]

          X         Y         Z
A  2.084019 -0.376519  0.230336
B  1.035125 -0.031160  1.939932

In [50]:
#usando notação númerica para buscar os mesmos dados
df.iloc[:2, 1:4]

          X         Y         Z
A  2.084019 -0.376519  0.230336
B  1.035125 -0.031160  1.939932

In [ ]:
#Fim da aula de data frames
#Inicio da aula da segunda aula de data frames

In [51]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [52]:
df>0

       W      X      Y      Z
A   True   True  False   True
B   True   True  False   True
C  False  False   True  False
D  False   True   True  False
E   True   True  False   True

In [53]:
bol = df>0

In [54]:
df[bol]

          W         X         Y         Z
A  0.386030  2.084019       NaN  0.230336
B  0.681209  1.035125       NaN  1.939932
C       NaN       NaN  0.187125       NaN
D       NaN  1.482495  0.961458       NaN
E  0.992573  1.192241       NaN  1.292765

In [56]:
df[df['W']>0]

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
E  0.992573  1.192241 -1.046780  1.292765

In [57]:
#quais valores dentro de df são maiores que zero
# em relação aos valores de W
df[df['W']>0]['Y']

A   -0.376519
B   -0.031160
E   -1.046780
Name: Y, dtype: float64

In [58]:
#ou pode ser feito assim
bol = df['W']>0
df2 = df[bol]
df2['Y']

A   -0.376519
B   -0.031160
E   -1.046780
Name: Y, dtype: float64

In [62]:
#usando duas condições para selecionar dados &=and
df[(df['W']>0) & (df['Y']>1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [63]:
#usando duas condições para selecionar dados |=or
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
E  0.992573  1.192241 -1.046780  1.292765

In [115]:
#resetando o index
df.reset_index(inplace=True)
#vai adicionar uma coluna sem nome que é o level_0 do reset

ValueError: cannot insert level_0, already exists

In [116]:
df

   level_0 index         W         X         Y         Z Estado
0        0     A  0.386030  2.084019 -0.376519  0.230336     RS
1        1     B  0.681209  1.035125 -0.031160  1.939932     RJ
2        2     C -1.005187 -0.741790  0.187125 -0.732845     SP
3        3     D -1.382920  1.482495  0.961458 -2.141212     AM
4        4     E  0.992573  1.192241 -1.046780  1.292765     SC

In [117]:
#removendo as colunas do reset
df2=df.iloc[:,1:]
df2

  index         W         X         Y         Z Estado
0     A  0.386030  2.084019 -0.376519  0.230336     RS
1     B  0.681209  1.035125 -0.031160  1.939932     RJ
2     C -1.005187 -0.741790  0.187125 -0.732845     SP
3     D -1.382920  1.482495  0.961458 -2.141212     AM
4     E  0.992573  1.192241 -1.046780  1.292765     SC

In [118]:
#colocando novamente o index certo d data frame
df2.set_index('index', inplace=True)

In [119]:
df2

              W         X         Y         Z Estado
index
A      0.386030  2.084019 -0.376519  0.230336     RS
B      0.681209  1.035125 -0.031160  1.939932     RJ
C     -1.005187 -0.741790  0.187125 -0.732845     SP
D     -1.382920  1.482495  0.961458 -2.141212     AM
E      0.992573  1.192241 -1.046780  1.292765     SC

In [70]:
#definindo coluna que são estados do brasil
col = 'RS RJ SP AM SC'. split()

In [71]:
col

['RS', 'RJ', 'SP', 'AM', 'SC']

In [97]:
df2['Estado']= col

In [98]:
df2

  index         W         X         Y         Z Estado
0     A  0.386030  2.084019 -0.376519  0.230336     RS
1     B  0.681209  1.035125 -0.031160  1.939932     RJ
2     C -1.005187 -0.741790  0.187125 -0.732845     SP
3     D -1.382920  1.482495  0.961458 -2.141212     AM
4     E  0.992573  1.192241 -1.046780  1.292765     SC

In [100]:
df2.set_index('Estado')

       index         W         X         Y         Z
Estado
RS         A  0.386030  2.084019 -0.376519  0.230336
RJ         B  0.681209  1.035125 -0.031160  1.939932
SP         C -1.005187 -0.741790  0.187125 -0.732845
AM         D -1.382920  1.482495  0.961458 -2.141212
SC         E  0.992573  1.192241 -1.046780  1.292765

In [120]:
df2

              W         X         Y         Z Estado
index
A      0.386030  2.084019 -0.376519  0.230336     RS
B      0.681209  1.035125 -0.031160  1.939932     RJ
C     -1.005187 -0.741790  0.187125 -0.732845     SP
D     -1.382920  1.482495  0.961458 -2.141212     AM
E      0.992573  1.192241 -1.046780  1.292765     SC

In [121]:
#note que não foi definido permanentemente
# é necessário utilizar o argumento ,inplace=True
df2.set_index('Estado', inplace=True)
df2

               W         X         Y         Z
Estado
RS      0.386030  2.084019 -0.376519  0.230336
RJ      0.681209  1.035125 -0.031160  1.939932
SP     -1.005187 -0.741790  0.187125 -0.732845
AM     -1.382920  1.482495  0.961458 -2.141212
SC      0.992573  1.192241 -1.046780  1.292765

In [122]:
df2

               W         X         Y         Z
Estado
RS      0.386030  2.084019 -0.376519  0.230336
RJ      0.681209  1.035125 -0.031160  1.939932
SP     -1.005187 -0.741790  0.187125 -0.732845
AM     -1.382920  1.482495  0.961458 -2.141212
SC      0.992573  1.192241 -1.046780  1.292765

In [ ]:
#fim da aula